app/Services/PendingUpdateService.php

select * from `campuses` where `campuses`.`id` = 1 limit 1
select * from `buildings` where `buildings`.`id` = 1 limit 1
---
    public static function transform($update)
    {
        $parsed = collect(json_decode($update->new_data, true));
        $labelMaps = [
            'campuses' => [
                'name' => 'Nama',
                'address' => 'Alamat',
                'contact' => 'Kontak',
                'email' => 'Email',
                'description' => 'Deskripsi',
            ],
            'buildings' => [
                'name' => 'Nama',
                'campus_id' => fn($v) => ['Kampus' => Campus::find($v)->name ?? 'Null'],
                'area' => 'Luas',
                'floor' => 'Lantai',
                'description' => 'Deskripsi',
                'address' => 'Alamat',
            ],
            'rooms' => [
                'name' => 'Nama',
                'building_id' => fn($v) => ['Gedung' => Building::find($v)->name ?? 'Null'],