app/Livewire/Dashboard.php

select count(*) as aggregate from `buildings`
select count(*) as aggregate from `rooms`
select count(*) as aggregate from `rooms` where `status` = 'class'
---
    public function render()
    {
        return view('livewire.admin.dashboard', [
            'campusCount' => Campus::count(),
            'buildingCount' => Building::count(),
            'roomCount' => Room::count(),
            'classCount' => Room::where('status', 'class')->count()