app/Livewire/Dashboard.php

    public function render()
    {
        return view('livewire.admin.dashboard', [
            'campusCount' => Campus::count(),
            'buildingCount' => Building::count()
        ]);
---
select count(*) as aggregate from `campuses`