app/Livewire/Homepage.php

select * from `campuses`
select * from `buildings`
select * from `rooms`
---
    public function render(){
        $campuses = Campus::all();
        $buildings = Building::all();
        $rooms = Room::all();