app/Livewire/Kampus.php

    public function render()
    {
        $buildings = Building::all();
---
select * from `buildings`