app/Livewire/ListKampus.php

    public function render()
    {
        $campuses = Campus::all();
---
select * from `campuses`