app/Livewire/TambahRuang.php

select * from `campuses`
select * from `buildings` where `campus_id` = 1
---
    public function mount()
    {
        $this->campuses = Campus::all();
        $this->status = 'class';

        if ($this->campuses->isNotEmpty()) {
            $this->campus_id = $this->campuses->first()->id;
            $this->buildings = Building::where('campus_id', $this->campus_id)->get();

select * from `rooms` limit 10 offset 0
select count(*) as aggregate from `rooms`
---
    public function render()
    {
        $rooms = Room::when($this->search !== '', fn(Builder $query) => $query->where('name', 'like', '%' . $this->search . '%'))->paginate(10);