app/Livewire/TambahGedung.php

    public function render()
    {
        $buildings = Building::with('campus')
            ->when($this->search !== '', fn(Builder $query)
                => $query->where('name', 'like', '%' . $this->search . '%'))
            ->paginate(10);
---
select * from `buildings` limit 10 offset 0
select count(*) as aggregate from `buildings`
select * from `campuses`