app/Livewire/TambahKampus.php

    public function render()
    {
        $campuses = Campus::when($this->search !== '', fn(Builder $query) => $query->where('name', 'like', '%' . $this->search . '%'))->get();
---
select * from `campuses` where `name` like '%ep%'